OpenFOAM-13/tutorials/isothermalFluid/potentialFreeSurfaceMovingOscillatingBox/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
runApplication subsetMesh -noFields
runApplication createPatch

cp -R 0.orig 0 > /dev/null 2>&1

runApplication foamRun

#------------------------------------------------------------------------------
